<?xml version="1.0" ?>
<net name="person-attributes-recognition-crossroad-0230" version="10">
	<layers>
		<layer id="0" name="0" type="Parameter" version="opset1">
			<data element_type="f16" shape="1, 3, 160, 80"/>
			<output>
				<port id="0" names="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>160</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="data_mul_796815144" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="1, 1, 1, 1" size="2"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="0/scale/Fused_Mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>160</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>160</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="data_add_797014778" type="Const" version="opset1">
			<data element_type="f16" offset="2" shape="1, 3, 1, 1" size="6"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="0/mean/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>160</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>160</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="1" type="Const" version="opset1">
			<data element_type="f16" offset="8" shape="16, 3, 7, 7" size="4704"/>
			<output>
				<port id="0" names="1" precision="FP16">
					<dim>16</dim>
					<dim>3</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="274/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="3, 3" pads_end="3, 3" strides="2, 2"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>160</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>3</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>80</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="274/Dims4570" type="Const" version="opset1">
			<data element_type="f16" offset="4712" shape="1, 16, 1, 1" size="32"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="274" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>80</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="274" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>80</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="275/mul_/Negate" type="Negative" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>80</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" names="275" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>80</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="276" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>80</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>80</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="2" names="276" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="data_mul_79727976" type="Const" version="opset1">
			<data element_type="f16" offset="4744" shape="1, 32, 1, 1" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="277/mean/Fused_Mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="data_add_79737978" type="Const" version="opset1">
			<data element_type="f16" offset="4808" shape="1, 32, 1, 1" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="277/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="277" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="278" type="MaxPool" version="opset1">
			<data auto_pad="explicit" kernel="3, 3" pads_begin="1, 1" pads_end="1, 1" rounding_type="floor" strides="2, 2"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" names="278" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="279" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="1" names="279" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="8" type="Const" version="opset1">
			<data element_type="f16" offset="4872" shape="24, 32, 1, 1" size="1536"/>
			<output>
				<port id="0" names="8" precision="FP16">
					<dim>24</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="280/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>24</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="280/Dims4558" type="Const" version="opset1">
			<data element_type="f16" offset="6408" shape="1, 24, 1, 1" size="48"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="280" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="280" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="281" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="1" names="281" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="10" type="Const" version="opset1">
			<data element_type="f16" offset="6456" shape="24, 24, 3, 3" size="10368"/>
			<output>
				<port id="0" names="10" precision="FP16">
					<dim>24</dim>
					<dim>24</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="282/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>24</dim>
					<dim>24</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="282/Dims4678" type="Const" version="opset1">
			<data element_type="f16" offset="16824" shape="1, 24, 1, 1" size="48"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="282" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="282" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="283/mul_/Negate" type="Negative" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="1" names="283" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="284" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="2" names="284" precision="FP16">
					<dim>1</dim>
					<dim>48</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="data_mul_79807984" type="Const" version="opset1">
			<data element_type="f16" offset="16872" shape="1, 48, 1, 1" size="96"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="285/mean/Fused_Mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>48</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>48</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="data_add_79817986" type="Const" version="opset1">
			<data element_type="f16" offset="16968" shape="1, 48, 1, 1" size="96"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="285/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>48</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="285" precision="FP16">
					<dim>1</dim>
					<dim>48</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="286" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>48</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="1" names="286" precision="FP16">
					<dim>1</dim>
					<dim>48</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="17" type="Const" version="opset1">
			<data element_type="f16" offset="17064" shape="64, 48, 1, 1" size="6144"/>
			<output>
				<port id="0" names="17" precision="FP16">
					<dim>64</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="287/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>48</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="287/Dims4612" type="Const" version="opset1">
			<data element_type="f16" offset="23208" shape="1, 64, 1, 1" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="287" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="287" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="19" type="Const" version="opset1">
			<data element_type="f16" offset="23336" shape="64, 32, 1, 1" size="4096"/>
			<output>
				<port id="0" names="19" precision="FP16">
					<dim>64</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="288/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="288/Dims4600" type="Const" version="opset1">
			<data element_type="f16" offset="27432" shape="1, 64, 1, 1" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="288" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="288" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="289" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="2" names="289" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="290" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="1" names="290" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="21" type="Const" version="opset1">
			<data element_type="f16" offset="27560" shape="24, 64, 1, 1" size="3072"/>
			<output>
				<port id="0" names="21" precision="FP16">
					<dim>24</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="291/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>24</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="291/Dims4618" type="Const" version="opset1">
			<data element_type="f16" offset="30632" shape="1, 24, 1, 1" size="48"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="291" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="291" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="292" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="1" names="292" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="23" type="Const" version="opset1">
			<data element_type="f16" offset="30680" shape="24, 24, 3, 3" size="10368"/>
			<output>
				<port id="0" names="23" precision="FP16">
					<dim>24</dim>
					<dim>24</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="293/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>24</dim>
					<dim>24</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="293/Dims4588" type="Const" version="opset1">
			<data element_type="f16" offset="41048" shape="1, 24, 1, 1" size="48"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="293" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="293" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="294/mul_/Negate" type="Negative" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="1" names="294" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="295" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="2" names="295" precision="FP16">
					<dim>1</dim>
					<dim>48</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="data_mul_79887992" type="Const" version="opset1">
			<data element_type="f16" offset="41096" shape="1, 48, 1, 1" size="96"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="296/mean/Fused_Mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>48</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>48</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="data_add_79897994" type="Const" version="opset1">
			<data element_type="f16" offset="41192" shape="1, 48, 1, 1" size="96"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="296/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>48</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="296" precision="FP16">
					<dim>1</dim>
					<dim>48</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="297" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>48</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="1" names="297" precision="FP16">
					<dim>1</dim>
					<dim>48</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="30" type="Const" version="opset1">
			<data element_type="f16" offset="41288" shape="64, 48, 1, 1" size="6144"/>
			<output>
				<port id="0" names="30" precision="FP16">
					<dim>64</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="298/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>48</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="298/Dims4546" type="Const" version="opset1">
			<data element_type="f16" offset="47432" shape="1, 64, 1, 1" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="298" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="298" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="299" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="2" names="299" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="300" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="1" names="300" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="32" type="Const" version="opset1">
			<data element_type="f16" offset="47560" shape="24, 64, 1, 1" size="3072"/>
			<output>
				<port id="0" names="32" precision="FP16">
					<dim>24</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="301/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>24</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="301/Dims4594" type="Const" version="opset1">
			<data element_type="f16" offset="50632" shape="1, 24, 1, 1" size="48"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="301" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="301" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="302" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="1" names="302" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="34" type="Const" version="opset1">
			<data element_type="f16" offset="50680" shape="24, 24, 3, 3" size="10368"/>
			<output>
				<port id="0" names="34" precision="FP16">
					<dim>24</dim>
					<dim>24</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="303/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>24</dim>
					<dim>24</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="303/Dims4696" type="Const" version="opset1">
			<data element_type="f16" offset="61048" shape="1, 24, 1, 1" size="48"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="303" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="303" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="304/mul_/Negate" type="Negative" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="1" names="304" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="305" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="2" names="305" precision="FP16">
					<dim>1</dim>
					<dim>48</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="data_mul_79968000" type="Const" version="opset1">
			<data element_type="f16" offset="61096" shape="1, 48, 1, 1" size="96"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="306/mean/Fused_Mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>48</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>48</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Pooling_" type="MaxPool" version="opset1">
			<data auto_pad="explicit" kernel="1, 1" pads_begin="0, 0" pads_end="0, 0" rounding_type="floor" strides="2, 2"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>48</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>48</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="data_add_79978002" type="Const" version="opset1">
			<data element_type="f16" offset="61192" shape="1, 48, 1, 1" size="96"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="306/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>48</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>48</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="307" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>48</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>48</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="41" type="Const" version="opset1">
			<data element_type="f16" offset="61288" shape="64, 48, 1, 1" size="6144"/>
			<output>
				<port id="0" names="41" precision="FP16">
					<dim>64</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="308/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>48</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="308/Dims4564" type="Const" version="opset1">
			<data element_type="f16" offset="67432" shape="1, 64, 1, 1" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="308" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Pooling_10224" type="MaxPool" version="opset1">
			<data auto_pad="explicit" kernel="1, 1" pads_begin="0, 0" pads_end="0, 0" rounding_type="floor" strides="2, 2"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="309" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="310" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="43" type="Const" version="opset1">
			<data element_type="f16" offset="67560" shape="48, 64, 1, 1" size="6144"/>
			<output>
				<port id="0" names="43" precision="FP16">
					<dim>48</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="311/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>48</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>48</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="311/Dims4672" type="Const" version="opset1">
			<data element_type="f16" offset="73704" shape="1, 48, 1, 1" size="96"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="311" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>48</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="311" precision="FP16">
					<dim>1</dim>
					<dim>48</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="312" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>48</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="1" names="312" precision="FP16">
					<dim>1</dim>
					<dim>48</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="45" type="Const" version="opset1">
			<data element_type="f16" offset="73800" shape="48, 48, 3, 3" size="41472"/>
			<output>
				<port id="0" names="45" precision="FP16">
					<dim>48</dim>
					<dim>48</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="313/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>48</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>48</dim>
					<dim>48</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>48</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="313/Dims4606" type="Const" version="opset1">
			<data element_type="f16" offset="115272" shape="1, 48, 1, 1" size="96"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="313" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>48</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="313" precision="FP16">
					<dim>1</dim>
					<dim>48</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="314/mul_/Negate" type="Negative" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>48</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="1" names="314" precision="FP16">
					<dim>1</dim>
					<dim>48</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="315" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>48</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>48</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="2" names="315" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="data_mul_80048008" type="Const" version="opset1">
			<data element_type="f16" offset="115368" shape="1, 96, 1, 1" size="192"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="316/mean/Fused_Mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="data_add_80058010" type="Const" version="opset1">
			<data element_type="f16" offset="115560" shape="1, 96, 1, 1" size="192"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="316/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="316" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="317" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="1" names="317" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="52" type="Const" version="opset1">
			<data element_type="f16" offset="115752" shape="64, 96, 1, 1" size="12288"/>
			<output>
				<port id="0" names="52" precision="FP16">
					<dim>64</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="318/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="318/Dims4702" type="Const" version="opset1">
			<data element_type="f16" offset="128040" shape="1, 64, 1, 1" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="318" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="318" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="54" type="Const" version="opset1">
			<data element_type="f16" offset="128168" shape="64, 64, 1, 1" size="8192"/>
			<output>
				<port id="0" names="54" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="319/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="319/Dims4642" type="Const" version="opset1">
			<data element_type="f16" offset="136360" shape="1, 64, 1, 1" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="319" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="319" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="320" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="2" names="320" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="321" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="1" names="321" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="56" type="Const" version="opset1">
			<data element_type="f16" offset="136488" shape="48, 64, 1, 1" size="6144"/>
			<output>
				<port id="0" names="56" precision="FP16">
					<dim>48</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="322/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>48</dim>
